## IMPORT LIBRARIES

In [15]:
import numpy as np
import pandas as pd
import pickle

## DATA READ

In [16]:
dataset = pd.read_csv('hiring.csv')
dataset.head(10)

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

## FEATURE ENGINEERING
###### Handling missing data

In [17]:
dataset.experience.fillna('zero',inplace=True)

In [18]:
dataset.test_score.fillna(0,inplace=True)

In [19]:
dataset.head(20)

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         0.0                7   72000
7     eleven         7.0                8   80000

## MODEL TRAINING

In [20]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [21]:
dataset["experience"] = le.fit_transform(dataset["experience"])
dataset.head(10)

   experience  test_score  interview_score  salary
0           6         8.0                9   50000
1           6         8.0                6   45000
2           1         6.0                7   60000
3           5        10.0               10   65000
4           2         9.0                6   70000
5           4         7.0               10   62000
6           3         0.0                7   72000
7           0         7.0                8   80000

## Seprating X = independent data and y = dependent data

In [27]:
X = dataset.drop('salary', axis=1)
y = dataset["salary"]

In [28]:
print(X)
print(y)

   experience  test_score  interview_score
0           6         8.0                9
1           6         8.0                6
2           1         6.0                7
3           5        10.0               10
4           2         9.0                6
5           4         7.0               10
6           3         0.0                7
7           0         7.0                8
0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary, dtype: int64

In [23]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()

In [25]:
lr.fit(X,y)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [26]:
pickle.dump(lr,open('model.pkl','wb'))